Evaluations/perf_testing/data/composePost/202404260949_30_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1404.482ms, rate sampling interval: 5451ms
  Thread calibration: mean lat.: 1555.286ms, rate sampling interval: 5914ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.44s     5.73s   20.81s    73.24%
    Req/Sec    12.50      1.61    15.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.99s 
 75.000%   10.82s 
 90.000%   12.56s 
 99.000%   20.81s 
 99.900%   21.86s 
 99.990%   21.86s 
 99.999%   21.86s 
100.000%   21.86s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.871     0.000000            1         1.00
     611.839     0.100000           50         1.11
     826.367     0.200000          100         1.25
    1261.567     0.300000          150         1.43
    2514.943     0.400000          200         1.67
    4993.023     0.500000          249         2.00
    6754.303     0.550000          274         2.22
    8978.431     0.600000          299         2.50
   10084.351     0.650000          324         2.86
   10436.607     0.700000          348         3.33
   10821.631     0.750000          373         4.00
   11034.623     0.775000          386         4.44
   11149.311     0.800000          398         5.00
   11444.223     0.825000          411         5.71
   11837.439     0.850000          423         6.67
   12140.543     0.875000          435         8.00
   12435.455     0.887500          442         8.89
   12763.135     0.900000          448        10.00
   14311.423     0.912500          454        11.43
   15237.119     0.925000          460        13.33
   17104.895     0.937500          466        16.00
   17874.943     0.943750          470        17.78
   18022.399     0.950000          473        20.00
   18759.679     0.956250          476        22.86
   19546.111     0.962500          479        26.67
   19873.791     0.968750          482        32.00
   19988.479     0.971875          484        35.56
   20103.167     0.975000          485        40.00
   20250.623     0.978125          487        45.71
   20348.927     0.981250          488        53.33
   20496.383     0.984375          490        64.00
   20676.607     0.985938          491        71.11
   20676.607     0.987500          491        80.00
   20807.679     0.989062          492        91.43
   20905.983     0.990625          493       106.67
   20971.519     0.992188          494       128.00
   20971.519     0.992969          494       142.22
   20971.519     0.993750          494       160.00
   21069.823     0.994531          495       182.86
   21069.823     0.995313          495       213.33
   21250.047     0.996094          496       256.00
   21250.047     0.996484          496       284.44
   21250.047     0.996875          496       320.00
   21250.047     0.997266          496       365.71
   21250.047     0.997656          496       426.67
   21856.255     0.998047          497       512.00
   21856.255     1.000000          497          inf
#[Mean    =     6443.925, StdDeviation   =     5729.577]
#[Max     =    21839.872, Total count    =          497]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  588 requests in 30.05s, 185.45KB read
  Socket errors: connect 0, read 0, write 0, timeout 825
  Non-2xx or 3xx responses: 222
Requests/sec:     19.57  
Transfer/sec:      6.17KB