Evaluations/perf_testing/data/composePost/202404260950_50_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1261.720ms, rate sampling interval: 4192ms
  Thread calibration: mean lat.: 1585.047ms, rate sampling interval: 5279ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     8.96s     5.85s   21.10s    59.41%
    Req/Sec    13.43      3.20    19.00     71.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.08s 
 75.000%   12.05s 
 90.000%   17.66s 
 99.000%   21.10s 
 99.900%   23.05s 
 99.990%   23.53s 
 99.999%   23.53s 
100.000%   23.53s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      31.103     0.000000            1         1.00
     892.415     0.100000           55         1.11
    1961.983     0.200000          109         1.25
    5079.039     0.300000          163         1.43
    7999.487     0.400000          217         1.67
   10084.351     0.500000          271         2.00
   10248.191     0.550000          300         2.22
   10452.991     0.600000          328         2.50
   10731.519     0.650000          354         2.86
   11239.423     0.700000          380         3.33
   12050.431     0.750000          407         4.00
   12607.487     0.775000          421         4.44
   12918.783     0.800000          434         5.00
   14311.423     0.825000          448         5.71
   15663.103     0.850000          461         6.67
   16744.447     0.875000          475         8.00
   17416.191     0.887500          482         8.89
   17661.951     0.900000          488        10.00
   18022.399     0.912500          495        11.43
   18251.775     0.925000          502        13.33
   19021.823     0.937500          509        16.00
   19251.199     0.943750          512        17.78
   19644.415     0.950000          515        20.00
   19939.327     0.956250          519        22.86
   20119.551     0.962500          522        26.67
   20201.471     0.968750          528        32.00
   20201.471     0.971875          528        35.56
   20267.007     0.975000          529        40.00
   20316.159     0.978125          531        45.71
   20365.311     0.981250          532        53.33
   20447.231     0.984375          534        64.00
   20529.151     0.985938          535        71.11
   21004.287     0.987500          536        80.00
   21102.591     0.989062          537        91.43
   21102.591     0.990625          537       106.67
   21331.967     0.992188          538       128.00
   21757.951     0.992969          539       142.22
   21757.951     0.993750          539       160.00
   21856.255     0.994531          540       182.86
   21856.255     0.995313          540       213.33
   21856.255     0.996094          540       256.00
   23052.287     0.996484          541       284.44
   23052.287     0.996875          541       320.00
   23052.287     0.997266          541       365.71
   23052.287     0.997656          541       426.67
   23052.287     0.998047          541       512.00
   23527.423     0.998242          542       568.89
   23527.423     1.000000          542          inf
#[Mean    =     8959.381, StdDeviation   =     5851.218]
#[Max     =    23511.040, Total count    =          542]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  697 requests in 30.05s, 221.91KB read
  Socket errors: connect 0, read 0, write 0, timeout 531
  Non-2xx or 3xx responses: 285
Requests/sec:     23.19  
Transfer/sec:      7.38KB