Evaluations/perf_testing/data/composePost/202404260951_70_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1772.408ms, rate sampling interval: 5922ms
  Thread calibration: mean lat.: 2517.699ms, rate sampling interval: 9060ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.22s     6.04s   22.22s    60.03%
    Req/Sec    16.20      5.74    23.00     40.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.97s 
 75.000%   12.43s 
 90.000%   18.50s 
 99.000%   22.22s 
 99.900%   23.20s 
 99.990%   23.25s 
 99.999%   23.25s 
100.000%   23.25s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      16.103     0.000000            1         1.00
    1014.783     0.100000           65         1.11
    2537.471     0.200000          129         1.25
    5521.407     0.300000          193         1.43
    7905.279     0.400000          258         1.67
    9969.663     0.500000          322         2.00
   10158.079     0.550000          357         2.22
   10362.879     0.600000          386         2.50
   10731.519     0.650000          418         2.86
   11395.071     0.700000          451         3.33
   12476.415     0.750000          483         4.00
   12836.863     0.775000          499         4.44
   13885.439     0.800000          515         5.00
   15212.543     0.825000          531         5.71
   16367.615     0.850000          547         6.67
   17842.175     0.875000          563         8.00
   18120.703     0.887500          571         8.89
   18497.535     0.900000          579        10.00
   19152.895     0.912500          587        11.43
   19693.567     0.925000          596        13.33
   19857.407     0.937500          603        16.00
   20054.015     0.943750          607        17.78
   20414.463     0.950000          611        20.00
   20561.919     0.956250          615        22.86
   20758.527     0.962500          619        26.67
   21135.359     0.968750          623        32.00
   21200.895     0.971875          625        35.56
   21282.815     0.975000          627        40.00
   21610.495     0.978125          629        45.71
   21839.871     0.981250          631        53.33
   21856.255     0.984375          633        64.00
   21889.023     0.985938          634        71.11
   21954.559     0.987500          635        80.00
   22118.399     0.989062          636        91.43
   22216.703     0.990625          637       106.67
   22233.087     0.992188          638       128.00
   22740.991     0.992969          639       142.22
   22740.991     0.993750          639       160.00
   23117.823     0.994531          640       182.86
   23117.823     0.995313          640       213.33
   23166.975     0.996094          641       256.00
   23166.975     0.996484          641       284.44
   23166.975     0.996875          641       320.00
   23199.743     0.997266          642       365.71
   23199.743     0.997656          642       426.67
   23199.743     0.998047          642       512.00
   23199.743     0.998242          642       568.89
   23199.743     0.998437          642       640.00
   23248.895     0.998633          643       731.43
   23248.895     1.000000          643          inf
#[Mean    =     9215.867, StdDeviation   =     6038.864]
#[Max     =    23232.512, Total count    =          643]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  806 requests in 30.05s, 256.04KB read
  Socket errors: connect 0, read 0, write 0, timeout 378
  Non-2xx or 3xx responses: 372
Requests/sec:     26.82  
Transfer/sec:      8.52KB